IDENTIFICATION DIVISION.
PROGRAM-ID. PDV.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-INPUT-BUFFER    PIC X(21).
01 WS-PRODUCT-ID      PIC X(3).
01 WS-PRODUCT-NAME    PIC X(15).
01 WS-QUANTITY        PIC X(3).

01 WS-RESPONSE        PIC X(256).
77 ID-NUMERIC         PIC 9(5).
77 QTY-NUMERIC        PIC 9(5).
77 ID-STR             PIC X(10).
77 QTY-STR            PIC X(10).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    ACCEPT WS-INPUT-BUFFER FROM CONSOLE.

    MOVE WS-INPUT-BUFFER(1:3)   TO WS-PRODUCT-ID.
    MOVE WS-INPUT-BUFFER(4:15)  TO WS-PRODUCT-NAME.
    MOVE WS-INPUT-BUFFER(19:3)  TO WS-QUANTITY.



    IF WS-PRODUCT-ID IS NUMERIC
        MOVE FUNCTION NUMVAL(WS-PRODUCT-ID) TO ID-NUMERIC
    ELSE
        MOVE 0 TO ID-NUMERIC
    END-IF
    IF WS-QUANTITY IS NUMERIC
        MOVE FUNCTION NUMVAL(WS-QUANTITY) TO QTY-NUMERIC
    ELSE
        MOVE 0 TO QTY-NUMERIC
    END-IF

    STRING '{"success":true,"product_id":'
        FUNCTION NUMVAL(WS-PRODUCT-ID)
        ',"product_name":"'
        FUNCTION TRIM(WS-PRODUCT-NAME TRAILING)
        '","quantity":'
        FUNCTION NUMVAL(WS-QUANTITY)
        ',"status":"OK"}'
        INTO WS-RESPONSE
    END-STRING.

    DISPLAY FUNCTION TRIM(WS-RESPONSE TRAILING).

    STOP RUN.
